/*--------------------------------
// 2025학년도 1학기 STL 월910수910				(5주 1일)
// 4월 10일 목요일
// 중간고사		- 8주 1일(4월 24일 목요일)
---------------------------------*/


/*-------------------------------------------------
// class STRING 작성시작 - STL의 표준 컨테이너가 되도록 발전시킨다
//						   벡터의 동작을 진짜 자세히 이해하려고...

// "표준 컨테이너"가 되고싶다면 어떻게 해야하는가
--------------------------------------------------*/

#include <iostream>
#include <string>
#include <memory>
#include <array>
#include "save.h"
#include "STRING.h"

// 다음시간 관찰메시지 해석에서 
STRING x{ "수업시간이 너무 짧아" };

//----------------
int main()
//----------------
{
	//STRING s{ "관찰하는 중" };
	STRING t;
	//save("메인.cpp");
}
