/*--------------------------------
// 2025학년도 1학기 STL 월910수910 
// 3월 17일 월요일
// 2주 2일
---------------------------------*/


/*-------------------------------------------------
// 많은 수의 자료를 다루기 - int 
--------------------------------------------------*/


#include <iostream>
#include <fstream>
#include <print>
#include "save.h"


// [문제] "int 1000개.txt" 파일에서 가장 큰 값을 찾아 화면에 출력하라
// 출력된 값을 답지에도 적어봐라

//----------------
int main()
//----------------
{
	{
		std::ifstream filein("int 1000개.txt");


	}
	
	save("메인.cpp");
}
