//-----------------------------------------------------------------------------
// 2025. 1. STL 월910목910	5월 12일 월요일
// 졸업작품 중간발표로 6:40 시작
// 6/19 목요일 15주 2일 - 기말 시험
// 5/12 월요일  - 졸업작품 중간 발표 이후에 시험친다
//-----------------------------------------------------------------------------
// 컨테이너들의 찾기 실력 알아보기
// 1. vector		- x				sorted vector	- 3
// 2. set			- 2
// 3. unordered_set	- 1
//-----------------------------------------------------------------------------

#include <iostream>
#include <algorithm>
#include "save.h"
#include "STRING.h"
using namespace std;
extern bool 관찰;




//---------
int main()
//---------
{

	//save("메인.cpp");
}
 
